dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csx.h
/***************************************************************************//**
* \file cy_capsense_csx.h
* \version 1.0
*
* \brief
* This file provides the function prototypes specific to the CSX sensing
* implementation.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CAPSENSE_CSX_H)
#define CY_CAPSENSE_CSX_H

#include "cy_syslib.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_common.h"


#if defined(__cplusplus)
extern "C" {
#endif


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_low_level *//** \{ */
/******************************************************************************/

void Cy_CapSense_CSXSetupWidget(uint32_t widgetId, cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXSetupWidgetExt(uint32_t widgetId, uint32_t sensorId, cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXScan(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXScanExt(cy_stc_capsense_context_t * context);

void Cy_CapSense_CSXConnectRx(const cy_stc_capsense_pin_config_t * rxPtr, cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXConnectTx(const cy_stc_capsense_pin_config_t * txPtr, cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXDisconnectRx(const cy_stc_capsense_pin_config_t * rxPtr, cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXDisconnectTx(const cy_stc_capsense_pin_config_t * txPtr, cy_stc_capsense_context_t * context);

cy_status Cy_CapSense_CSXCalibrateWidget(uint32_t widgetId, uint32_t target, cy_stc_capsense_context_t * context);

/** \} */


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

void Cy_CapSense_CSXConnectRxExt(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXConnectTxExt(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXDisconnectRxExt(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXDisconnectTxExt(cy_stc_capsense_context_t * context);

void Cy_CapSense_CSXSetUpIdacs(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXDisableMode(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXInitialize(cy_stc_capsense_context_t * context);
void Cy_CapSense_CSXElectrodeCheck(cy_stc_capsense_context_t * context);

void Cy_CapSense_CSXSetWidgetTxClkSrc(const cy_stc_capsense_widget_config_t * ptrWdConfig);
void Cy_CapSense_CSXScanISR(void * capsenseContext);

/** \} \endcond */

/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_CSX_DEADBAND_CYCLES_NUMBER             (2u)

/*******************************************************************************
* Register Configuration
*******************************************************************************/

/*
 * +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  0     | IREF_SEL      | Select Iref according to IrefSel parameter                                             |
 * |  8:4   | FILTER_DELAY  | 0x02(2-SampleClk cycles)                                                               |
 * |  11:10 | SHIELD_DELAY  | 0x00(Delay Line is OFF)                                                                |
 * |  12    | SENSE_EN      | 0x01(Enabled. Switches can be closed)                                                  |
 * |  17    | FULL_WAVE     | 0x00(Half Wave Mode)                                                                   |
 * |  18    | MUTUAL_CAP    | 0x01(Mutual-cap mode)                                                                  |
 * |  19    | CSX_DUAL_CNT  | 0x01(Use two counters)                                                                 |
 * |  24    | DSI_COUNT_SEL | 0x00(CSD-Result on DSI_COUNT bus)                                                      |
 * |  25    | DSI_SAMPLE_EN | 0x00(DSI_SAMPLE_IN is disabled)                                                        |
 * |  26    | SAMPLE_SYNC   | 0x00(Double sync is disabled)                                                          |
 * |  27    | DSI_SENSE_EN  | 0x00(DSI_SENSE_IN is disabled)                                                         |
 * |  30    | LP_MODE       | 0x00(High power mode)                                                                  |
 * |  31    | ENABLE        | 0x01(Analog part is ON)                                                                |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_CONFIG_DEFAULT_EN_CFG                  (0x80001000uL)
#define CY_CAPSENSE_CONFIG_DEFAULT_FILTER_DELAY_CFG        (0x00000020uL)
#define CY_CAPSENSE_CONFIG_DEFAULT_MUTUAL_CFG              (0x00040000uL)
#define CY_CAPSENSE_CONFIG_DEFAULT_DUAL_CNT_CFG            (0x00080000uL)

